#!/usr/bin/env python
# coding: utf-8

from nltk import CFG
from nltk.parse import RecursiveDescentParser

grammer = CFG.fromstring("""
S -> NS|VS
NS -> SBJ PRD
VS -> V0 SBJ | V1 SBJ OBJ1 | V2 SBJ OBJ1 OBJ2
PRD -> N|PP|NS|VS
PP -> P N
SBJ -> N
OBJ1 -> N
OBJ2 -> N
N -> 'الماء'|'الكريم'|'الكثير'|'الشجاع'|'الرسول'|'محمد'|'الطفل'|'العدو'|'الصاحب'|'الطالب'|'الدرس'|'الصلاة'|'الحق'|'المسافر'|'الطريق'|'الرجل'|'الخطأ'|'الأرض'|'حق'|'كل'|'ثوب'|'جديد'|'درس'|'سهل'|'ماء'|'كريم'|'كثير'|'شجاع'|'رسول'|'طفل'|'عدو'|'صاحب'|'طالب'|'درس'|'حق'|'صلاة'|'حق'|'مسافر'|'طريق'|'رجل'|'خطأ'|'أرض'|'صاحبه'|'حقه'|'الامتحان'
P -> 'في'|'الى'|'من'|'عن'|'على'
V0 -> 'تفتح'|'فاض'|'ثار'|'هبت'|'جلس'|'ضاع'|'خرج'|'نام'|'وقعد'|'سافر'|'صدق'
V1 -> 'طوى'|'أكل'|'بلل'|'زرع'|'أطفأ'|'يركب'|'يستجيب'|'حفظ'|'كتب'|'شاهد'|'قال'
V2 -> 'يسقي'|'كسا'|'أعطى'|'ظن'|'حسب'|'جعل'|'خال'|'منح'|'منع'|'ألبس'
""")

#####RecursiveDescentParser######

tdParser = RecursiveDescentParser(grammer)
def rdp(s):
    for w in tdParser.parse(s.split()):
        print (w)

###########

